#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.shared.data.terraform_remote_state.infrastructure_state: Reading...
module.shared.data.terraform_remote_state.infrastructure_state: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.add_investment_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_investment_function_object" {
      ~ etag                   = "1a9187caf07e598a164478d42fa8fe80" -> "5d325baeed8763c44a3f432dfc1608aa"
        id                     = "lambdas/demo/add_investment_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_scenario_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_scenario_function_object" {
      ~ etag                   = "138fce208455867cdf795c2157cedc06" -> "6022c2772f40b89dda28727ffaf68478"
        id                     = "lambdas/demo/add_scenario_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_tag_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_tag_function_object" {
      ~ etag                   = "c1123ff65e58455c2803610a9c139e22" -> "e002d2b4828b9c5cf9fffd7f44118dcf"
        id                     = "lambdas/demo/add_tag_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_user_to_customer_group_function_object" {
      ~ etag                   = "fdb22b03186e034d2f3ad36a8ac9c359" -> "8e08d6a203b30ea840d68be59470f330"
        id                     = "lambdas/demo/add_user_to_customer_group_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "assign_company_permissions_function_object" {
      ~ etag                   = "a231e48c3825c28030c27db9e0762522" -> "de4adea80cc1fdddfdd838408c9b92b2"
        id                     = "lambdas/demo/assign_company_permissions_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.authorize_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "authorize_function_object" {
      ~ etag                   = "3c74802ac168ad18370a9f18da5daf4a" -> "6d41229281c54e6b9b048dad30cd35d4"
        id                     = "lambdas/demo/authorize_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_company_publicly_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_company_publicly_function_object" {
      ~ etag                   = "7780a3644ae34baea4133c41027a1077" -> "59ce2d886350d02aaa063d32a8a95ce3"
        id                     = "lambdas/demo/change_company_publicly_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_user_role_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_user_role_function_object" {
      ~ etag                   = "299797f3ff7c4db9b9ef89e470a3f2dd" -> "fafd301f6cfedfc28ab90fb762e8f6cd"
        id                     = "lambdas/demo/change_user_role_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.connect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "connect_function_object" {
      ~ etag                   = "a74f9553df3db6adf2f153d872e8d860" -> "f8d8ad2538ab3226ba39f01b6be66d37"
        id                     = "lambdas/demo/connect.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_company_function_object" {
      ~ etag                   = "a9e96dbf874739ace423d7db4b349a24" -> "73fed0395264dabbf6f199a80afc5079"
        id                     = "lambdas/demo/delete_company_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_scenarios_function_object" {
      ~ etag                   = "d6a908d8bd9812de11063cc3b8c9aee9" -> "3859178fd760480985aebc44a4521eeb"
        id                     = "lambdas/demo/delete_scenarios_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_tags_function_object" {
      ~ etag                   = "f3eb11b6122a44e7bf9e19a19bfed129" -> "b29c691caad7e20bf7713e9824c68ef6"
        id                     = "lambdas/demo/delete_tags_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.disconnect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "disconnect_function_object" {
      ~ etag                   = "099462c75bbc35aad64420b3abc39b52" -> "706957d5e35e374705722d1ddfc52772"
        id                     = "lambdas/demo/disconnect.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "download_comparison_vs_peers_function_object" {
      ~ etag                   = "50b27f722a90029c64a48bfe8cdcf4e5" -> "94b9162b9b9d3e263f20622b74707e13"
        id                     = "lambdas/demo/download_comparison_vs_peers_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "edit_modify_data_function_object" {
      ~ etag                   = "18ca3c99a66eb872d249c3490029ed34" -> "088124daf150fba58edc17b5b968879a"
        id                     = "lambdas/demo/edit_modify_data_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag                   = "99b554252bac292eb30aaf462d724c9e" -> "dea0e83a64ddf8ca60e530d6d8679085"
        id                     = "lambdas/demo/get_all_companies_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_public_companies_function_object" {
      ~ etag                   = "e18529d699f31c43c6d9eafba39d989e" -> "8ff79cd0eedd61766210a54bdeaf5117"
        id                     = "lambdas/demo/get_all_public_companies_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_ranges_function_object" {
      ~ etag                   = "f36e8605fcd9e936796a88a406dd71b0" -> "aed5938a096ea1f7752257d341601729"
        id                     = "lambdas/demo/get_all_ranges_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_tags_function_object" {
      ~ etag                   = "a5ae479002b6f16a560b5ccec763f3e7" -> "b987242dd4cb9852a567a35785d84069"
        id                     = "lambdas/demo/get_all_tags_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_by_metric_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_by_metric_report_function_object" {
      ~ etag                   = "415d53d97baa11dc0dab3ba758fa7b7a" -> "7451e8c258fbb9779c02d128b4ff98b8"
        id                     = "lambdas/demo/get_by_metric_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_details_function_object" {
      ~ etag                   = "40dbf7d1124fce793d8a43a9bf521441" -> "9e6496018324fb3623a8510521b40ea8"
        id                     = "lambdas/demo/get_company_details_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_investments_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_investments_function_object" {
      ~ etag                   = "df9eac77089b99937a4a71d00af0b48e" -> "df8d3ea0e3378b45c5fa383383544a1b"
        id                     = "lambdas/demo/get_company_investments_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_permissions_function_object" {
      ~ etag                   = "4f0f4ce63589fefe35b8c48c5c86d70a" -> "398bcb1831160a2fe7304e536f4cdbb1"
        id                     = "lambdas/demo/get_company_permissions_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_report_vs_peers_function_object" {
      ~ etag                   = "7dc88662e87e6e7761554adac895ace4" -> "1368b5ecbcd14d2c4c62605d7b1b3152"
        id                     = "lambdas/demo/get_company_report_vs_peers_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_comparison_vs_peers_function_object" {
      ~ etag                   = "e3c8f5573556400524022efe3f0dbf15" -> "d9d06134f147c95e718a1488d243d2c7"
        id                     = "lambdas/demo/get_comparison_vs_peers_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_dynamic_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_dynamic_report_function_object" {
      ~ etag                   = "499879305c585bd5403d803e2a16f9a8" -> "46411a179973ced54607c4c06a22c70f"
        id                     = "lambdas/demo/get_dynamic_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_edit_modify_data_function_object" {
      ~ etag                   = "fa293ecd20f81b6c6f5c864df2e3849a" -> "16fc38d8242e8dd26f2c7d067e2cca57"
        id                     = "lambdas/demo/get_edit_modify_data_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_full_year_total_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_full_year_total_function_object" {
      ~ etag                   = "457ef580b09d15d2671bfe6af93c51dc" -> "6615cdf7741c1256867af7edf5799fd5"
        id                     = "lambdas/demo/get_full_year_total_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_date_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_date_report_function_object" {
      ~ etag                   = "1bcc6f3537817de051ccdd97d707471f" -> "ce794ac60dd9fb6df81154070e6b6c37"
        id                     = "lambdas/demo/get_investment_date_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metric_types_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_types_function_object" {
      ~ etag                   = "f6a0bcdabe4c814892d1d22a15740f60" -> "d33302aaf4c4222b7a93e4cae71726f5"
        id                     = "lambdas/demo/get_metric_types_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_quarters_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_quarters_report_function_object" {
      ~ etag                   = "a4cbb79da720dedc8e7544b2f15ef541" -> "3667713bc4284cc459adeb9d8f6d034b"
        id                     = "lambdas/demo/get_quarters_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_ranges_by_metric_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_ranges_by_metric_function_object" {
      ~ etag                   = "ccd3aa0a1eab82590e3c7fbf6ef169d4" -> "59e031f381add37dbb0dbfb868bdabb8"
        id                     = "lambdas/demo/get_ranges_by_metric_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_roles_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_roles_function_object" {
      ~ etag                   = "0e4631e01fec92596df50d2db5186c79" -> "0ffa2c0befd929cd0dce259a55cdd8fd"
        id                     = "lambdas/demo/get_roles_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_tags_by_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_tags_by_company_function_object" {
      ~ etag                   = "682e75b1caf450f69cadd1b7934c1daf" -> "f2c8e8141f785f0ab03697af3b471bd8"
        id                     = "lambdas/demo/get_tags_by_company_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_universe_overview_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_universe_overview_function_object" {
      ~ etag                   = "c92f854ec3ab0bdbbf735bd8ad667ff9" -> "eb3918e9505e0df741c14266c09e0d70"
        id                     = "lambdas/demo/get_universe_overview_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_user_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_user_details_function_object" {
      ~ etag                   = "4541bdc7d425655afc57bb6a017c4ea3" -> "006e49002f3b5421e9d3f724fc4c1e35"
        id                     = "lambdas/demo/get_user_details_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_users_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_users_function_object" {
      ~ etag                   = "6de3126cbc05066bef3960b24bbb456e" -> "1edddeb956a75fcf5e4c0f99216bfee6"
        id                     = "lambdas/demo/get_users_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag                   = "f806ab407aa795eb4f7d6a84bb92e072" -> "724940829e3fb35fbb9877091531ff86"
        id                     = "lambdas/demo/glue_trigger_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag                   = "3fab50b2cfbee531fb8a2ec71118dd53" -> "af611d51ac5821b3ce5e173ce2721bc7"
        id                     = "layer/demo/layer_libraries.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.message_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "message_function_object" {
      ~ etag                   = "5630e63e86ce2377129a4647f5c85211" -> "0d8834000cb84ec5a0b12c4b29c32d43"
        id                     = "lambdas/demo/message.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.modify_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "modify_ranges_function_object" {
      ~ etag                   = "0a23d2a43a498e54f6bb0ac87e09f906" -> "88f9289a59e7352f786dcc3f544d02f6"
        id                     = "lambdas/demo/modify_ranges_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.register_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "register_function_object" {
      ~ etag                   = "972a8e8857b05d045f749fce9346e004" -> "38fe5c657c44f1dc87052019e8a31d16"
        id                     = "lambdas/demo/register.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_data_function_object" {
      ~ etag                   = "bae2aaa22e35c2804cec31aa8579115f" -> "60b9ff7c9c19ca2b6ce0665ec9bce08b"
        id                     = "lambdas/demo/update_data.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_tags_function_object" {
      ~ etag                   = "bac493b72cd8eec4a9721f85b6891615" -> "e78da3b110febc8ea1de96110b8a3cdc"
        id                     = "lambdas/demo/update_tags_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.upload_file_s3_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "upload_file_s3_function_object" {
      ~ etag                   = "ccff770714c5e867fa2c6e89d056d82c" -> "d9e875c738cf1ee4e8a58be0b0ac05bb"
        id                     = "lambdas/demo/upload_file_s3_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.validate_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "validate_data_function_object" {
      ~ etag                   = "29eec7318948fc39aed191b40826a4a3" -> "d29fdb8a0603b37ec937afe2d87ee32f"
        id                     = "lambdas/demo/validate_data_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "verify_users_with_same_email_function_object" {
      ~ etag                   = "15d4198afe2f5f8c93f2e51736bdd5f9" -> "ccec7d84ac5391b4b8721fa26b437b17"
        id                     = "lambdas/demo/verify_users_with_same_email_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.add_investment_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_investment_lambda_function" {
        id                             = "demo_add_investment_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:51.000+0000" -> (known after apply)
      ~ source_code_hash               = "VJzi2FZAjWs3gCL4yaWdfdoWVbbdeIAA8O5nCT/lSzc=" -> "+l6V186vpjn7X9GZa5+RtsG6MWaV2APRvcllVIl4dkQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_scenario_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_scenario_lambda_function" {
        id                             = "demo_add_scenario_lambda_function"
      ~ last_modified                  = "2023-02-25T06:35:10.000+0000" -> (known after apply)
      ~ source_code_hash               = "HfsPnfFwAcCKIIRR3kIvjdOVsd5kWaaRa1k/HESLvyw=" -> "0DKaXkzboFyzIoNWbb7nmkQvuK6+GBY4tJe1yf82kqU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_tag_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_tag_lambda_function" {
        id                             = "demo_add_tag_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:49.000+0000" -> (known after apply)
      ~ source_code_hash               = "G0oZmQWS1IuPjJ7XxNs7Xp+P1DhHAuymm9Ke6AMC3b8=" -> "HhmQuifGVK/2Ld+yMb4DltgRezF4QbwaVp04LtsvR1k="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_user_to_customer_group_lambda_function" {
        id                             = "demo_add_user_to_customer_group_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:38.000+0000" -> (known after apply)
      ~ source_code_hash               = "UHI16C/6AHoAq8VMWtvuAWvyRso6KO8Ytu1VazKbaPQ=" -> "D3P8PZDxM67Ulr/cJl4/0l0sZNSEaeo/Yu+kp+P/U60="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.assign_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "assign_company_permissions_lambda_function" {
        id                             = "demo_assign_company_permissions_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:29.000+0000" -> (known after apply)
      ~ source_code_hash               = "DA7Yk46+3X9vCyfgStYrt16zlwo6eBFej/SzGn5V3CQ=" -> "AJL5sLY0YnogCv1cY8LBcIa6n0ZvQvEgsOrh0XZteKI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.authorize_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "authorize_lambda_function" {
        id                             = "demo_authorize_lambda_function"
      ~ last_modified                  = "2023-02-25T06:35:07.000+0000" -> (known after apply)
      ~ source_code_hash               = "bZo9QajI4Pyzxp7DtwGVs/lTFZbTaWFr9UVHI78fglA=" -> "VeCFdWeCbLhGmQjiKtMNoLX+LYsdlPg2auYHK7F7eAM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_company_publicly_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_company_publicly_lambda_function" {
        id                             = "demo_change_company_publicly_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:40.000+0000" -> (known after apply)
      ~ source_code_hash               = "0k85PMPiIvePYFtySZIL7VSIFbxwnwf+B9byMlZig+Q=" -> "HScRXIzZt8JPcQa5rS0G7qZU62HVYrSk0304/rGAne8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_user_role_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_user_role_lambda_function" {
        id                             = "demo_change_user_role_lambda_function"
      ~ last_modified                  = "2023-02-25T06:35:04.000+0000" -> (known after apply)
      ~ source_code_hash               = "DYbVgi+8YHrYe7pGXzrm6ek93YeV+kIHNziI1pOoGKA=" -> "GSe8GX0oSEaapAZ0biOf8RpxPPlv4XJ8cfGuK/iIIp4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.connect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "connect_lambda_function" {
        id                             = "demo_connect_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:51.000+0000" -> (known after apply)
      ~ source_code_hash               = "1ywQdkuBJ/nEtZV7D88RKHFha+d5qeGeQhPY/RlLyx4=" -> "vPZ7uBOeN7CUcXE19U9mM3t6/NCxO3I7jnh3XB7mobQ="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.aws_lambda_function.delete_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_company_lambda_function" {
        id                             = "demo_delete_company_lambda_function"
      ~ last_modified                  = "2023-02-25T06:35:06.000+0000" -> (known after apply)
      ~ source_code_hash               = "zATW/1W49/GwSXlgtYq3Fz/UxCXmjl2FnR4LA/V9MU0=" -> "N5SHkd9EpMToFNesocA+rrWQ9ennNSCjfCqfnMaXbm0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_scenarios_lambda_function" {
        id                             = "demo_delete_scenarios_lambda_function"
      ~ last_modified                  = "2023-02-25T06:35:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "LRcZXQ0vFBCUroGE6pAw4buAhLU4IaFAGwqXFPeOKRw=" -> "sNXQAUIKwYYavC5CrZYsjwo6gQ3suKVWlQX2iFHIx+Y="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_tags_lambda_function" {
        id                             = "demo_delete_tags_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:56.000+0000" -> (known after apply)
      ~ source_code_hash               = "IoIDDv8t2G5DXlKnVXRmDmk27GDUHosU0swzEY63zlI=" -> "0wl2l30+uKLAQvJga6beXPuWlJtdZNb0JZK7/FKKacY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.disconnect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "disconnect_lambda_function" {
        id                             = "demo_disconnect_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:29.000+0000" -> (known after apply)
      ~ source_code_hash               = "kx1bsToC3y2yGpUUsEeSt99ZOqrE7jTTgi8C4xBJywg=" -> "gnwtjtQSJpvMNAXMEyP3sVqp9w94V9sJuYS4F7gQIuo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "download_comparison_vs_peers_lambda_function" {
        id                             = "demo_download_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2023-02-25T06:35:04.000+0000" -> (known after apply)
      ~ source_code_hash               = "kWhev/K1zW2wAyWSh+F3gIydRp1gl6tntrag3zQ2aNA=" -> "GAMvgAdEYYzYLKjvl9iBc9Uw1u/eLdKl2lZQqCKDk+M="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "edit_modify_data_lambda_function" {
        id                             = "demo_edit_modify_data_lambda_function"
      ~ last_modified                  = "2023-02-25T06:35:04.000+0000" -> (known after apply)
      ~ source_code_hash               = "PX3mSayp0CcYSsyoCrhgsG6+b/OI5GE2NGGRBLAsd2o=" -> "AxM82SwmbMn7wEXzmK8StEJeNjS8FmgMkuF3HoEpPig="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:50.000+0000" -> (known after apply)
      ~ source_code_hash               = "PIPdwsYUi+hjvJSqqsojSrgWbe+RyxtU+r4cIKt459U=" -> "QCxMc943+XcjPPgicyBevwrzOa2uGX94TkL92jEA1KQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_public_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_public_companies_lambda_function" {
        id                             = "demo_get_all_public_companies_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "9hP3+UGOt2c6Kl/eylW7ei7QVUWbo5HxYBDaz5DhfFA=" -> "iRYTbhoxF4SK3g7AomTZTZvTl5SBtYD05FC1tuLGer8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_ranges_lambda_function" {
        id                             = "demo_get_all_ranges_lambda_function"
      ~ last_modified                  = "2023-02-25T06:35:09.000+0000" -> (known after apply)
      ~ source_code_hash               = "biIy3xSjWPSuEp3/1l3GyHhi+jWJkV+s/S9ffh1Mu98=" -> "VERoGltd2zskPv+V7mnBSFTV4xqDc0QbFdPWtCqWZJM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_tags_lambda_function" {
        id                             = "demo_get_all_tags_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "T8xXPXa/LSn3msarzgtF5wwjfSDZCA8jew9D2VDsEuk=" -> "j1BPLE7aKnQZgXH1EB+Rtj5/gL81i9sgEpOEW5ipujk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_by_metric_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_by_metric_report_lambda_function" {
        id                             = "demo_get_by_metric_report_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:38.000+0000" -> (known after apply)
      ~ source_code_hash               = "K3ayvGV2Jes9mgXfkjcet7AvxB/TYn1f2vvNGZqTFQs=" -> "VTOrFoPI8BSVexPOze2LLX+IHApQzjEAUOnunI6Y1C4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_details_lambda_function" {
        id                             = "demo_get_company_details_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "xmG7coqLvkn5DPg+GQXITO78hcUWtDyNTjZBbqOcNwY=" -> "sQxusc2hWhdBOs7x3K0YykcR7xWgx+vxtp169j6yV+k="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_investments_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_investments_lambda_function" {
        id                             = "demo_get_company_investments_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "d1nToCh0it2WqLEaIiz6XhpmzzA+AFUXiKM52Xu6U10=" -> "LAkaYc/9Dri0ZcnNWmRRnWxzqELWJepLV8d2ZhBsxLA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_permissions_lambda_function" {
        id                             = "demo_get_company_permissions_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:38.000+0000" -> (known after apply)
      ~ source_code_hash               = "/eQCpOiFic/fYSeHd1L5RzY32n2GqeK0klu1xWNex3M=" -> "ageGtj8pP3kgNfmiTqghG9oGl7VG57sRO5POZZnQkTI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_report_vs_peers_lambda_function" {
        id                             = "demo_get_company_report_vs_peers_lambda_function"
      ~ last_modified                  = "2023-02-25T06:35:02.000+0000" -> (known after apply)
      ~ source_code_hash               = "rARbwgGSfqLhTNTcEmUiGsaV3PJCkOxFQGErlda6Kjk=" -> "PYbPNxgrdGsit270IBJg3edY1J8lmFiAF7oEtFiH34U="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_comparison_vs_peers_lambda_function" {
        id                             = "demo_get_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:57.000+0000" -> (known after apply)
      ~ source_code_hash               = "WQNRRCnvfUEauOWa55m7I+xQQuy4DA2SsYxd6GXn450=" -> "8yV216g3wg5bD3Y0J56320GkDI0uYXe/mWMVCKBoLOc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_dynamic_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_dynamic_report_lambda_function" {
        id                             = "demo_get_dynamic_report_lambda_function"
      ~ last_modified                  = "2023-02-25T06:35:03.000+0000" -> (known after apply)
      ~ source_code_hash               = "8N/uXKdcl83E3y6cjPq5Vo0L4RmwfJYzh/TiwZEgiKg=" -> "iGCgA0AWpNiy3TYnSPgZ+5fZ2krgzxupPNf8LVtHrgE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_edit_modify_data_lambda_function" {
        id                             = "demo_get_edit_modify_data_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "rph39hHqJYN+OXMDpQfEvT9SyudPKsQCrI09Oaszq/M=" -> "8r3FvhpXwghA4U6SDDpB/45UarZM/SQZyUCrqrlDL4M="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_full_year_total_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_full_year_total_lambda_function" {
        id                             = "demo_get_full_year_total_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:40.000+0000" -> (known after apply)
      ~ source_code_hash               = "LmY1896e52qDZWkI3NuDYb2Yoow4PnheJygi8KVCRpI=" -> "vOOmkcJd5yfBO9v6FnPizNrb6yKcG31E43IE9m6IpKQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_date_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_date_report_lambda_function" {
        id                             = "demo_get_investment_date_report_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:50.000+0000" -> (known after apply)
      ~ source_code_hash               = "BMvOY6h3yZRrpu7SIO5slmo7Ub18OAmL9b0WggrrQnI=" -> "oqeN0qZYyd1cvcAnugD8hORVIAkVSZL9iabgyYSB6wA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metric_types_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_types_lambda_function" {
        id                             = "demo_get_metric_types_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "R/6dfpuTjanEVov8jgWUoe4j9L25O5nPD/r5tGB2LAU=" -> "/X3NMxQxWoOhQzdouhgKWlVziCPb7Kwj0j8i1+1Gkgc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_quarters_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_quarters_report_lambda_function" {
        id                             = "demo_get_quarters_report_lambda_function"
      ~ last_modified                  = "2023-02-28T19:16:13.000+0000" -> (known after apply)
      ~ source_code_hash               = "ZHEauuuxs7NlOwzY7a07EZZ5at4kF7q/9KBd4XXNFls=" -> "84yvjGRRWQjEhOH0KKdv8SjkLhRKZoRt+ekVPtw8TmM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_ranges_by_metric_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_ranges_by_metric_lambda_function" {
        id                             = "demo_get_ranges_by_metric_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:50.000+0000" -> (known after apply)
      ~ source_code_hash               = "GfAOxrw/atfTjDf5Slf+h21iBbmHFZLv3AqbZoMBMqM=" -> "RF9+NMiXfxjE6KLsVi4T/V8vZ1pOmWY2Oe6EROkrWR8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_roles_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_roles_lambda_function" {
        id                             = "demo_get_roles_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "xk56/2fDVt0nFuQ4ybtFGsYQweO4dzW31fHJqjcD4UY=" -> "INFzqKAvmoOE8kTwyre2NsTwd9tGgHpmDcxuYv2UANg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_tags_by_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_tags_by_company_lambda_function" {
        id                             = "demo_get_tags_by_company_lambda_function"
      ~ last_modified                  = "2023-02-25T06:35:01.000+0000" -> (known after apply)
      ~ source_code_hash               = "c5A7U6aVtpRZRERXUHknoOdyggTyWKONqa/TIQOSsWE=" -> "HdhmU6ad18/y8sfWiw71kYEwOX2B/Asvc8FBMBF2HNc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_universe_overview_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_universe_overview_lambda_function" {
        id                             = "demo_get_universe_overview_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "xj9Q2SkaEJ8dUej7DvnHDx520J0/3JZk2+VNTvta560=" -> "0/eeBJS9sbOEVhPEzuwG1/SJ3g7y4KwyO6pQPbdW3i8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_user_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_user_details_lambda_function" {
        id                             = "demo_get_user_details_lambda_function"
      ~ last_modified                  = "2023-02-25T06:35:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "+YnPZGcYbYKNbf5MEgWMNH/ayzXSQl4DCPq29cKoV7Q=" -> "uh2IQ2eInkw5g40Pl8r9UwFelxu2K9oPZJNP5AO+NWA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_users_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_users_lambda_function" {
        id                             = "demo_get_users_lambda_function"
      ~ last_modified                  = "2023-02-25T06:35:14.000+0000" -> (known after apply)
      ~ source_code_hash               = "Mok1sWN2I0vZpSz2LQ7Hya5Mv7+W4cTNqMS7PI+iYYY=" -> "WadHfwyL/WpdCfXV/aqEUd4Pndw+siOsCJM6FhwkoFI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:52.000+0000" -> (known after apply)
      ~ source_code_hash               = "MtkxsJONSm4xP2azLn7eSvAjiCLVNk04xctBr5Xp5Qw=" -> "Q//pwjal9Ds0A6btCHwwGSh7zu3zIoCn4WGUPWWfwyk="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.message_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "message_lambda_function" {
        id                             = "demo_message_lambda_function"
      ~ last_modified                  = "2023-02-25T06:35:14.000+0000" -> (known after apply)
      ~ source_code_hash               = "tNJ+auMsdJIf6WNHGHUMLs73sXQZTI019JIXI0Xrlg8=" -> "wY/UusX3dtwtlzZZsvO8XRXbzyvxA0d2DYlv7JuOeT8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.modify_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "modify_ranges_lambda_function" {
        id                             = "demo_modify_ranges_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "/zYmg18AUpLAQ3yCgrCyAj/08/Ar41PzX3mi7sAzG1I=" -> "CbQDhMKjW9unJVo+Mok6/AeXmatwCHaiHUHuOrejKvE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.register_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "register_lambda_function" {
        id                             = "demo_register_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:44.000+0000" -> (known after apply)
      ~ source_code_hash               = "gua1kqpNTQVklaE7AoOyajWYC3UgQp2oYAb0vhR/M+U=" -> "C4iY8fo4MRyfjvAuPi7pPTA97OKXJoDG5Al+vt/vxSQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_data_lambda_function" {
        id                             = "demo_update_data_lambda_function"
      ~ last_modified                  = "2023-02-25T06:35:14.000+0000" -> (known after apply)
      ~ source_code_hash               = "SCgMzA5srf2nA5kfdD697XtlWOpZZzKgydItBU7vQ2M=" -> "kwR1SXCpfF0uXIYqm6v8YM960ZY3rkZacCcLZEuee2c="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_tags_lambda_function" {
        id                             = "demo_update_tags_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:53.000+0000" -> (known after apply)
      ~ source_code_hash               = "ESeZnaifn72asVnZDCPDMIgKkOgXfYlm0PoEK8zuSf4=" -> "TwFgfqtAT/Na2cUHsin/BZTGfBeeZF2UIafMYOwx6Bw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.upload_file_s3_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "upload_file_s3_lambda_function" {
        id                             = "demo_upload_file_s3_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:44.000+0000" -> (known after apply)
      ~ source_code_hash               = "/TZ1vGdMjchIyprAh+tyg6TGcWpl3MQ7mVLbnRCgSj0=" -> "tlkwW+l9XKFVCEDlKhCTO+Ncupg4+umNh3OPAghQ1n8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.validate_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "validate_data_lambda_function" {
        id                             = "demo_validate_data_lambda_function"
      ~ last_modified                  = "2023-02-25T06:35:14.000+0000" -> (known after apply)
      ~ source_code_hash               = "z10zdYdvtZH25sJVPWV2zeUNy14GR+P2dBQCtx1kH8I=" -> "iI4UOEGQxJ8LgzUUr9NKRwi+hBUK41cITaM5502dSL8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "verify_users_with_same_email_lambda_function" {
        id                             = "demo_verify_users_with_same_email_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:38.000+0000" -> (known after apply)
      ~ source_code_hash               = "a9Uhfb6/OPj58LqMguuslqsSuPPbvk66hDmDq0pJ5/Q=" -> "1vOAgtYGj/fFz5aOu6U0ruhnDxgxXE9FzFx/g3+L8g0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2023-02-25T06:34:22Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "edetfb" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2023-02-25T06:34:21Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_deployment.deploy will be updated in-place
  ~ resource "aws_apigatewayv2_deployment" "deploy" {
      ~ description   = "Deployed at 2023-02-25T06:34:21Z" -> (known after apply)
        id            = "ey3sgf"
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_stage.stage will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "stage" {
        id              = "demo"
        name            = "demo"
        tags            = {}
        # (8 unchanged attributes hidden)

      - access_log_settings {
          - destination_arn = "arn:aws:logs:us-west-2:435552912911:log-group:testing_websocket_api" -> null
          - format          = jsonencode(
                {
                  - caller       = "$context.identity.caller"
                  - connectionId = "$context.connectionId"
                  - eventType    = "$context.eventType"
                  - ip           = "$context.identity.sourceIp"
                  - requestId    = "$context.requestId"
                  - requestTime  = "$context.requestTime"
                  - routeKey     = "$context.routeKey"
                  - status       = "$context.status"
                  - user         = "$context.identity.user"
                }
            ) -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 95 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @FreddyJR1995, Action: `pull_request`*